app/Http/Controllers/Api/PostsController.php

select * from `posts` limit 3 offset 0
select count(*) as aggregate from `posts`
---
    public function index(){

        $posts = Post::with('users')->paginate(3);