app/Http/Controllers/postsController.php

    public function index()
    {
        $posts = Post::paginate(2);//3dd el posts in one page
---
select * from `posts` limit 2 offset 4
select count(*) as aggregate from `posts`

    public function create()
    {
        $users = User::all();
---
select * from `users`

    public function show($id){
    //    dd(route('posts.show'));
       return view('posts.show',[
           'post'=>Post::findOrFail($id)
       ]);
---
select * from `posts` where `posts`.`id` = '1' limit 1

    public function edit($id){
        $post=Post::find($id);
        $users = User::all();
---
select * from `posts` where `posts`.`id` = '6' limit 1
select * from `users`

    public function update(Request $request,Post $post)
    {


        $new_post = $request->only(['title', 'description', 'user_id']);
        $post->update($new_post);
---
update `posts` set `slug` = 'dfghl-jnbpoikjh', `updated_at` = '2018-04-16 13:59:41' where `id` = '6'